Revit 2027 API
ElectricalDemandFactorDefinition.SetValues Method
 Sets the value set to the demand factor definition.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValues(
	ICollection<ElectricalDemandFactorValue> values
)
Public Sub SetValues (
	values As ICollection(Of ElectricalDemandFactorValue)
)
public:
void SetValues(
	ICollection<ElectricalDemandFactorValue^>^ values
)
member SetValues :
        values : ICollection<ElectricalDemandFactorValue> -> unit
Parameters
values ICollection<ElectricalDemandFactorValue>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace